In [2]:
import pandas as pd

# Importing Pandas...and feeding them to ..Python I might get arrested..

In [ ]:
import pandas as pd

draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex1.csv')    # Supply the file name (path)

draft1

### For windows system in order to read a file from a specicified path we need to a r in front of the path.

### This happens because there's a fault with the compatibility of the windows machine and pandas library.

### Or else we can use a back slash instead of forward slash with out using r in the front..like the one in the below cell.

In [4]:
draft2 = pd.read_table('C:/Users/lahari/Downloads/code_pandas1/examples/test.tsv')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

read_table is for tab seperated file.(tsv files)

In [5]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex1.csv',header = None)    

draft1

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

### By default header will be infer...which is pointing out the first row as the coloumn header

### we can also rename the coloumn index names by ......names = [dcsd,AS,AfFwF,Aefwrfarw,ADfcfWG,DefWv]....some random names.

In [6]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex1.csv',names = ['dcsd','AS','AfFwF','Aefwrfarw','ADfcfWG','DefWv'])
draft1

  dcsd  AS AfFwF Aefwrfarw  ADfcfWG  DefWv
0    a   b     c         d  message    NaN
1    1   2     3         4    hello    NaN
2    5   6     7         8    world    NaN
3    9  10    11        12      foo    NaN

If coloumn index names are more than the coloumns in the data set (data frame) the it will try to fill null values.... NaN

In [7]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\csv_mindex.csv')
draft1

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

### we can also convert coloumns as the row indexes.....

In [8]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\csv_mindex.csv',index_col=['key1'])
draft1

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [9]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\csv_mindex.csv',index_col = ['key1','key2'])
draft1

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex4.csv')
draft1

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

### Here there is a bit of junk data.In Order to skip these rows.....

In [11]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex4.csv',skiprows = [0,2,3])
draft1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\csv_mindex.csv',skiprows = [0,2,3])
draft1

   one  a   1   2
0  one  d   7   8
1  two  a   9  10
2  two  b  11  12
3  two  c  13  14
4  two  d  15  16

In [13]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex5.csv',na_values=None)
draft1

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

### purposely if i wat to consider some values as NaN values....then..

In [26]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex5.csv',na_values=['one'])
draft1

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
draft1 = pd.read_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\ex5.csv',na_values=['one','two'])
draft1

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

### we can also read from a excel sheet...

In [29]:
draft1 = pd.read_excel("excel file path",sheet_name=.....(name of the sheet))

SyntaxError: invalid syntax (<ipython-input-29-658580e43ccd>, line 1)

### we can also read a html page with the url provided ...

In [30]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"
data = pd.read_html(url)
data

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

### It will only read the tabular data in that html page...not every data set ...It interprets by reading only the data which is in table tag...(HTML)

### output type will be list

In [33]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')  
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [34]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### here we used the seperator as \t because for a csv file by default separator will be comma(,)

In [35]:
titanic_train.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [36]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### here we can see we got data type of every coloumn.

In [40]:
titanic_train['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [41]:
type(titanic_train['Pclass'])

pandas.core.series.Series

### this data type is series and not dataframe because we selected one particular coloumn.

In [46]:
titanic_train[['Pclass','Survived','PassengerId']].head(10)

   Pclass  Survived  PassengerId
0       3         0            1
1       1         1            2
2       3         1            3
3       1         1            4
4       3         0            5
5       3         0            6
6       1         0            7
7       3         0            8
8       3         1            9
9       2         1           10

In [47]:
type(titanic_train[['Pclass','Survived','PassengerId']])

pandas.core.frame.DataFrame

In [48]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t',nrows =10)
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### The difference between head and nrows is...head tries to read all the data and the display only the number of rows u want,Whereas nrows reads and also displays only the particular no of rows you want.

In [49]:
chunk = pd.read_csv('/Users/lahari/Downloads/code_pandas1/examples/ex6.csv', chunksize=1000)
chunk

### chunksize is nothing but limiting the read operation to a particular size.

In [50]:
data

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [51]:
data[0]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

### if we want to store this data permanantly over here rather than using the url every time...

In [65]:
data[0].to_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\out1.csv',sep='\t')

### It created an out1.csv file and saved the data.

In [66]:
data[0].to_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\out1.csv',sep='\t',header = None,index = False)

### this will give the original data without the default coloumn indexes and row indexes.

### we can also give our own coloumn names and row names

In [68]:
data[0].columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [76]:
data[0].to_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\out1.csv',sep='\t',index = False,columns = ['prithvi', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF' , 'PTS'])

### .Dates

In [17]:
dates = pd.date_range('1/1/2000', periods=7,freq = 'Y')
dates

DatetimeIndex(['2000-12-31', '2001-12-31', '2002-12-31', '2003-12-31',
               '2004-12-31', '2005-12-31', '2006-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [18]:
dates = pd.date_range('1/1/2000', periods=7,freq = 'M')
dates

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31'],
              dtype='datetime64[ns]', freq='M')

In [19]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [24]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

### arange()function in numpy is similar to normal range() function,as it also accepts floating point numbers,whereas that's not the case in normal range function

### that's the only difference

In [23]:
import numpy as np
ts = pd.Series(np.arange(7))
ts

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

### the beauty of series in pandas, it generates indexes and display them as well.

### We can give our own indexes .

In [26]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7),index = dates )
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [27]:
ts = pd.Series(np.arange(7),index = ['re','er','ef','ec','tg',9,7] )
ts

re    0
er    1
ef    2
ec    3
tg    4
9     5
7     6
dtype: int32

In [30]:
ts['re']

0

In [31]:
ts[9]

5

### I can also save this data set.

In [34]:
ts.to_csv(r'C:\Users\lahari\Downloads\code_pandas1\examples\out2.csv',sep = '\t')

C:\Users\lahari\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [35]:
import csv
f = open('/Users/lahari/Downloads/code_pandas1/examples/ex7.csv')

reader = csv.reader(f)
reader

### since this is a generator object we can iterate through a for loop and extract the data

In [36]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [38]:
with open('/Users/lahari/Downloads/code_pandas1/examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [39]:
header, values = lines[0], lines[1:]

In [41]:
header

['a', 'b', 'c']

In [42]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [48]:
for i in zip([1,2,3],[5,6,7]):
    print(i)

(1, 5)
(2, 6)
(3, 7)

In [45]:

for i in zip(header, zip(*values)):
    print(i)

('a', ('1', '1'))
('b', ('2', '2'))
('c', ('3', '3'))

In [40]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### another way

In [46]:
d={}
for i in zip(header, zip(*values)):
    d[i[0]] = i[1]
d

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## JSON

In [63]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [64]:
type(obj)

str

In [65]:
import json
result = json.loads(obj)
type(result)

dict

In [66]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

### if you want to convert this dictionary in to a string then...

In [67]:
ajson =json.dumps(result)
type(ajson)

str

In [68]:
ajson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [70]:
result['siblings']

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [69]:
siblings = pd.DataFrame(result['siblings'],columns = ['name','age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [61]:
data = pd.read_json('/Users/lahari/Downloads/code_pandas1/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [62]:
type(data)

pandas.core.frame.DataFrame

In [71]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [72]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [73]:
tables = pd.read_html('/Users/lahari/Downloads/code_pandas1/examples/fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

.read_html always returns a list

In [74]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [75]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [76]:
close_timestamps.dt.year

0      2016
1      2016
2      2016
3      2016
4      2016
       ...
542    2001
543    2001
544    2001
545    2000
546    2000
Name: Closing Date, Length: 547, dtype: int64

In [77]:
close_timestamps.dt.date

0      2016-09-23
1      2016-08-19
2      2016-05-06
3      2016-04-29
4      2016-03-11
          ...
542    2001-07-27
543    2001-05-03
544    2001-02-02
545    2000-12-14
546    2000-10-13
Name: Closing Date, Length: 547, dtype: object

In [78]:
close_timestamps.dt.day

0      23
1      19
2       6
3      29
4      11
       ..
542    27
543     3
544     2
545    14
546    13
Name: Closing Date, Length: 547, dtype: int64

In [80]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

### Binary Data Formats

In [81]:
frame = pd.read_csv('/Users/lahari/Downloads/code_pandas1/examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [85]:
frame.to_pickle('/Users/lahari/Downloads/code_pandas1/examples/frame_pickle')